app/views/student_reviews/show.html.erb

SELECT  1 AS one FROM "reviews" LIMIT ?  [["LIMIT", 1]]
---

<% if !Review.all.empty? %>